In [287]:
import pandas as pd
import numpy as np

In [288]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [289]:
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)           NaN      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France           NaN    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

## question 1

In [290]:
df['FlightNumber'][1]=10055
df['FlightNumber'][3]=10075

F:\softwares\ANACONDA\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
F:\softwares\ANACONDA\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [291]:
df['FlightNumber'].astype(int )

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

In [292]:
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)       10055.0      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France       10075.0    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

## question2

In [293]:
X=df.From_To.str.split('_').str[0]
Y=df.From_To.str.split('_').str[1]

In [294]:
temp_df=pd.DataFrame([X,Y],index=['From',"to"]).transpose()

# question 3

In [300]:
temp_df['From']=temp_df['From'].str.title()
temp_df['to']=temp_df['to'].str.title()

In [301]:
temp_df

       From         to
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

## question 4

In [303]:
df=pd.concat([df,temp_df],axis=1)

In [304]:
df.drop('From_To',axis=1,inplace=True)

In [305]:
df

               Airline  FlightNumber  RecentDelays      From         to
0               KLM(!)       10045.0      [23, 47]    London      Paris
1    <Air France> (12)       10055.0            []    Madrid      Milan
2  (British Airways. )       10065.0  [24, 43, 87]    London  Stockholm
3       12. Air France       10075.0          [13]  Budapest      Paris
4          "Swiss Air"       10085.0      [67, 32]  Brussels     London

## question 5

In [307]:
extra=df['RecentDelays']
extra

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

In [311]:
# applied this function three times in order to create 3 NaN values as some rows were having blank values
for i in range(5):
    (extra[i].append('NaN'))  
print(extra)

0        [23, 47, NaN, NaN, NaN]
1                [NaN, NaN, NaN]
2    [24, 43, 87, NaN, NaN, NaN]
3            [13, NaN, NaN, NaN]
4        [67, 32, NaN, NaN, NaN]
Name: RecentDelays, dtype: object

In [312]:
x=[]
y=[]
z=[]
for i in range(5):
    x.append(extra[i][0])
    y.append(extra[i][1])
    z.append(extra[i][2])

In [313]:
extra=pd.DataFrame([x,y,z]).transpose()

In [314]:
extra

     0    1    2
0   23   47  NaN
1  NaN  NaN  NaN
2   24   43   87
3   13  NaN  NaN
4   67   32  NaN

In [315]:
df=pd.concat([df,extra],axis=1)

In [316]:
df

,Airline,FlightNumber,RecentDelays,From,to,0,1,2
0,KLM(!),10045.0,"[23, 47, NaN, NaN, NaN]",London,Paris,23,47,NaN
1,<Air France> (12),10055.0,"[NaN, NaN, NaN]",Madrid,Milan,NaN,NaN,NaN
2,(British Airways. ),10065.0,"[24, 43, 87, NaN, NaN, NaN]",London,Stockholm,24,43,87
3,12. Air France,10075.0,"[13, NaN, NaN, NaN]",Budapest,Paris,13,NaN,NaN
4,"""Swiss Air""",10085.0,"[67, 32, NaN, NaN, NaN]",Brussels,London,67,32,NaN

In [275]:
df.drop(['RecentDelays'],axis=1,inplace=True)

In [317]:
df.rename(columns={'to':'To',0:'Delay_1',1:'Delay_2',2:'Delay_3'},inplace=True)

In [318]:
df

,Airline,FlightNumber,RecentDelays,From,To,Delay_1,Delay_2,Delay_3
0,KLM(!),10045.0,"[23, 47, NaN, NaN, NaN]",London,Paris,23,47,NaN
1,<Air France> (12),10055.0,"[NaN, NaN, NaN]",Madrid,Milan,NaN,NaN,NaN
2,(British Airways. ),10065.0,"[24, 43, 87, NaN, NaN, NaN]",London,Stockholm,24,43,87
3,12. Air France,10075.0,"[13, NaN, NaN, NaN]",Budapest,Paris,13,NaN,NaN
4,"""Swiss Air""",10085.0,"[67, 32, NaN, NaN, NaN]",Brussels,London,67,32,NaN